Trancemania/proj_xtr_keil/More_STM32F4xx_Ethernet_Example/Project/FreeRTOS/httpserver_netconn/src/main.c
  /* Initilaize the LwIP stack */
  LwIP_Init();
  
  /* Initialize webserver demo */
  http_server_netconn_init();

#ifdef USE_DHCP
  /* Start DHCPClient */
  xTaskCreate(LwIP_DHCP_task, "DHCPClient", configMINIMAL_STACK_SIZE * 4, NULL,DHCP_TASK_PRIO, NULL);
#endif

  /* Start UDP task */
//  xTaskCreate(LwIP_UDP_task, "UDP", configMINIMAL_STACK_SIZE * 4, NULL, UDP_TASK_PRIO, NULL);

  /* Start toogleLed4 task : Toggle LED4  every 250ms */
  xTaskCreate(ToggleLed4, "LED4", configMINIMAL_STACK_SIZE, NULL, LED_TASK_PRIO, NULL);
	
  /* Start custom task : printf */
  xTaskCreate(Printf_task, "Printf", configMINIMAL_STACK_SIZE * 4, NULL, PRINTF_TASK_PRIO, NULL);

  /* Start custom task : ETH_printf */
//  xTaskCreate(ETH_Printf_task, "ETH_Printf", configMINIMAL_STACK_SIZE * 4, NULL, ETH_PRINTF_TASK_PRIO, NULL);

//ETH send ready
	
  /* Start scheduler */
  vTaskStartScheduler();

  /* We should never get here as control is now taken by the scheduler */
  for( ;; );

}

/**
  * @brief  custom printf task
  * @param  pvParameters not used
  * @retval None
  */
void Printf_task(void * pvParameters)
{
  int ch;
	int cnt = 0;
	uint8_t buffer[128];
  for ( ;; ) {
    
    while (USART_GetFlagStatus(CUSTOM_COM1, USART_FLAG_RXNE) == RESET);
  	
    ch = USART_ReceiveData(CUSTOM_COM1);
		
		if (ch == 0x0A){
				cnt = 0;
				buffer[cnt] = ch;
				cnt++;
				while (buffer[cnt-1] != 0x0D){
					while (USART_GetFlagStatus(CUSTOM_COM1, USART_FLAG_RXNE) == RESET);
					ch = USART_ReceiveData(CUSTOM_COM1);
					switch (ch){
						case 0x0D:   //0A send 
							buffer[cnt] = ch;
							ETH_length = cnt + 1;
							p = pbuf_alloc(PBUF_TRANSPORT, ETH_length, PBUF_RAM);
							memcpy(p->payload, &buffer, ETH_length);
							p->len = ETH_length;
							udp_sendto_if(pcb, p, &dst_addr, dst_port, &xnetif);
							pbuf_free(p);
							cnt++;
							break;
						default:
							//if cnt>=127
							buffer[cnt] = ch;
							cnt++;
							break;
					}

				}
			
			
		}
	  
//    switch (ch){
//			case 0x0A:   //0A send 
//				buffer[cnt] = ch;
//				ETH_length = cnt + 1;
//				p = pbuf_alloc(PBUF_TRANSPORT, ETH_length, PBUF_RAM);
//				memcpy(p->payload, &buffer, ETH_length);
//				p->len = ETH_length;
//				udp_sendto_if(pcb, p, &dst_addr, dst_port, &xnetif);
//				pbuf_free(p);
//				cnt = 0;
//				break;
//			default:
//				//if cnt>=127
//				buffer[cnt] = ch;
//				cnt++;
//				break;
//		}
//		if( xSemaphore_UDP != NULL )    {
			
//				ETH_printf("%c", ch&0xff);    
//    DMA_printf(USART1, "%c", ch&0xff);
//		}
  }
}


void udp_recv_fn(void *arg, struct udp_pcb *pcb, struct pbuf *p, struct ip_addr *addr, u16_t port){
	if (p != NULL) {
		memcpy(ETH_recv_buffer, &p->payload, p->len);
		command_H = ETH_recv_buffer[1];
		command_L = ETH_recv_buffer[0];
		if (command_H == 0x00 || command_H == 0xFF) {
			GPIO_SetBits(GPIOA, GPIO_Pin_3|GPIO_Pin_5|GPIO_Pin_8|GPIO_Pin_15);
			GPIO_SetBits(GPIOD, GPIO_Pin_11);
			GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5|GPIO_Pin_6|GPIO_Pin_7);
			//delete task
			if( printf_xHandle != NULL ) {
				vTaskDelete( printf_xHandle );
			}
			//pwm duty rate 0%
			TIM_SetAutoreload(TIM3, 1333);
			TIM_SetCompare1(TIM3, 0);
		}
		else {
			GPIOE->ODR = ((GPIOE->ODR)&(~0xC0)) | ((((~command_L)&0x01)<<7) | (((~command_L)&0x20)<<1));
			GPIOA->ODR = ((GPIOA->ODR)&(~0x128)) | ((((~command_L)&0x02)<<2) | (((~command_L)&0x04)<<3) | (((~command_L)&0x08)<<5));
			GPIOD->ODR = ((GPIOD->ODR)&(~0x800)) | (((~command_L)&0x10)<<7);
			switch (command_H) {
				case 0x01:   	//self test
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
						//pwm
					TIM_SetAutoreload(TIM3, 1330);
					TIM_SetCompare1(TIM3, 0);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_ResetBits(GPIOE, GPIO_Pin_0);
					GPIO_SetBits(GPIOE, GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5);
					break;
				case 0x02:   	//gyro pulse
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
						TIM_SetAutoreload(TIM3, 1330);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field

					break;
				case 0x03:		//comp 3k
					//delete task
				 if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1330);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_ResetBits(GPIOE, GPIO_Pin_3);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x04:		//comp 4k
					//delete task
				  if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1330);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x05:		//half circle lock
					//delete task
				  if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1330);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_ResetBits(GPIOE, GPIO_Pin_4);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x06:		//3 loop 48 3k
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1500);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_ResetBits(GPIOE, GPIO_Pin_3);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x07:		//3 loop 52 3k
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1500);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_ResetBits(GPIOE, GPIO_Pin_3);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x08:		//3 loop 68 3k
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1500);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_ResetBits(GPIOE, GPIO_Pin_3);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x09:		//3 loop 72 3k
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1500);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_ResetBits(GPIOE, GPIO_Pin_3);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x0A:		//3 loop 48 4k
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1400);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x0B:		//3 loop 52 4k
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1400);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x0C:		//3 loop 58 4k
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1400);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x0D:		//3 loop 62 4k
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1400);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x0E:		//rpm 100
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1000);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_ResetBits(GPIOE, GPIO_Pin_3);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x0F:		//rpm 200
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 2000);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_ResetBits(GPIOE, GPIO_Pin_3);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x10:		//rpm 100
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1000);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x11:		//rpm 200
					//delete task
				  if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 2000);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x12:		//up 3k
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1333);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_ResetBits(GPIOE, GPIO_Pin_3);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x13:		//down 3k
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1333);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_ResetBits(GPIOE, GPIO_Pin_3);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x14:		//left 3k
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1333);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_ResetBits(GPIOE, GPIO_Pin_3);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x15:		//right 3k
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1333);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_ResetBits(GPIOE, GPIO_Pin_3);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x16:		//up 4k
					//delete task
				  if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1333);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x17:		//down 4k
					//delete task
				  if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1333);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x18:		//left 4k
					//delete task
				  if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1333);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x19:		//right 4k
					//delete task
				  if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1333);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x1A:		//lock 3k
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1333);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_ResetBits(GPIOE, GPIO_Pin_3);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x1B:		//lock 4k
					//delete task
				  if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1333);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x1D:		//channel 3k
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm Frequency of change
//					if (T==1) T1=1400; else if (T==2) T1=1510;else if (T==3) T1=1600;else if (T==4) T1=1570;else if (T==5) T1=1510;else if (T==6) T1=1470;else if (T==7) T1=1380;else if (T==8) T1=1300;else if (T==9) T1=1210;else if (T==10) T1=1160;else if (T==11) T1=1130;else if (T==12) T1=1170;else if (T==13) T1=1090;else if (T==14) T1=1090;else T1=1330;
//					TIM_SetAutoreload(TIM3, T1);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_ResetBits(GPIOE, GPIO_Pin_3);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x1F:		//channel 4k
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm  Frequency of change
//					if (T==1) T1=1400; else if (T==2) T1=1510;else if (T==3) T1=1600;else if (T==4) T1=1570;else if (T==5) T1=1510;else if (T==6) T1=1470;else if (T==7) T1=1380;else if (T==8) T1=1300;else if (T==9) T1=1210;else if (T==10) T1=1160;else if (T==11) T1=1130;else if (T==12) T1=1170;else if (T==13) T1=1090;else if (T==14) T1=1090;else T1=1330;
//					TIM_SetAutoreload(TIM3, T1);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0x20:		//test 3k
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
						TIM_SetAutoreload(TIM3, 1330);
					TIM_SetCompare1(TIM3, 0);
				  //gpio
					GPIO_ResetBits(GPIOA, GPIO_Pin_15);
					GPIO_ResetBits(GPIOE, GPIO_Pin_3);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_4|GPIO_Pin_5);
					break;
				case 0x21:		//test 4k
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
						TIM_SetAutoreload(TIM3, 1330);
					TIM_SetCompare1(TIM3, 0);
				  //gpio
					GPIO_ResetBits(GPIOA, GPIO_Pin_15);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5);
					
					break;
				case 0x22:		//regulate 3k
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1333);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_ResetBits(GPIOE, GPIO_Pin_3);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_4|GPIO_Pin_5);
					
					break;
				case 0x23:		//regulate 4k
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1333);
					TIM_SetCompare1(TIM3, 100);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5);
					
					break;
				case 0x24:		//wireless
					//delete task
					if( printf_xHandle != NULL ) {
						vTaskDelete( printf_xHandle );
					}
					//pwm
					TIM_SetAutoreload(TIM3, 1330);
					TIM_SetCompare1(TIM3, 0);
				  //gpio
					GPIO_SetBits(GPIOA, GPIO_Pin_15);
					GPIO_ResetBits(GPIOE, GPIO_Pin_1);
					GPIO_SetBits(GPIOE, GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5);
					//l/s field
					
					break;
				case 0xF0:		//uart send
					xTaskCreate(Printf_task, "Printf", configMINIMAL_STACK_SIZE * 4, NULL, PRINTF_TASK_PRIO, &printf_xHandle);
					break;
				default:
					break;
			}
			
